{"posts":[{"title":"2024关键词","text":"关键词 变化 微博 跌宕","link":"/2024/09/19/2024%E5%85%B3%E9%94%AE%E8%AF%8D/"},{"title":"写在2025","text":"下笔的契机 深夜睡觉不踏实看表03:06 翻看到workcopy 里面躺着blog的代码库 最新一条是去年 那今年也有一些新变化 可以说道说道 小变化关于工作 去年落笔后就再度进行了创业 去年十月借用着别人的办公室 2个人. 现在有起色.有主营业务.换了更大的办公室 关于生活 今年出去了三趟 日本 韩国 马代 马代体验最好.不累且美 韩国最差.没景.人文也就那样对中国人不友好. 日本很喜欢属于常去. 拍照已经有些乏味了.这个爱好可能快放下了 Iracing 新的爱好","link":"/2025/09/24/2025%E4%B8%80%E5%B9%B4%E4%B8%80%E5%BA%A6/"},{"title":"GPT的文章能力","text":"笔记软件测评在本次测评中，我们将对以下四款笔记软件进行比较：Notion, Obsidian, Drafts, 和 Crafts。我们将从以下几个方面进行评测： 功能特性 跨平台支持 价格 用户界面与体验 社区与生态系统 Notion功能特性 富文本编辑器 数据库功能 模板系统 任务与项目管理 协作功能 跨平台支持 Windows macOS iOS Android Web 价格 免费版（个人使用） 个人专业版：$4/月 团队版：$8/月/成员 企业版：$20/月/成员 用户界面与体验 界面简洁，容易上手 丰富的快捷键支持 可自定义页面样式 社区与生态系统 拥有庞大的用户社区 丰富的插件与集成 Obsidian功能特性 以Markdown为基础的编辑器 双向链接 图谱视图 插件系统 本地存储 跨平台支持 Windows macOS Linux iOS (Obsidian Mobile) Android (Obsidian Mobile) 价格 免费（个人使用） 付费版（商业用途）：$25/月 用户界面与体验 界面适合程序员和Markdown爱好者 可自定义主题和样式 丰富的快捷键支持 社区与生态系统 拥有活跃的用户社区 丰富的插件和主题选择 Drafts功能特性 快速捕捉想法 强大的文本处理功能 支持自定义操作和脚本 可以将文本发送到其他应用 跨平台支持 iOS macOS 价格 免费版 专业版：$1.99/月 或 $19.99/年 用户界面与体验 界面简洁，专注于文本输入 丰富的快捷键支持 可自定义操作和脚本 社区与生态系统 拥有一定规模的用户社区 支持与其他应用集成 Crafts功能特性 富文本编辑器 支持卡片式内容组织 双向链接 支持多人协作 跨平台支持 macOS iOS iPadOS 价格 免费版 专业版：$4.99/月 或 $44.99/年 用户界面与体验 界面简洁，容易上手 支持手势操作 可自定义样式 社区与生态系统 相对较小的用户社区 尚无丰富的插件和集成 总结以上四款笔记软件各有特点，选择时可根据自己的需求和平台进行权衡。Notion适合需要强大数据库和协作功能的用户；Obsidian则更适合喜欢Markdown和本地存储的用户；Drafts则以快速捕捉想法和文本处理为特点；Crafts则是一款适用于苹果生态系统的富文本笔记应用。","link":"/2023/03/08/Ai/"},{"title":"ChatGPT体验一二","text":"前言目前ChatGpt火热，目前相关的产品基本都使用了一遍。 Notion AI Craft AI New Bing Drafts 脚本 Siri 快捷指令 Raycast AI能力 Notion AI &amp; Crafts AI两款可以放到一起来聊。基本作用跟方便程度基本一致均能做到，所问即可用。确实用来创作文字很是高效。目前暂时没有很多文字需要AI辅助输出，而且日常使用obsidian作为主要的笔记，所以这两款尝鲜之后并没有持续使用。 New Bing提升体验大，主要是来源结合了搜索引擎，但是目前使用频率还不高，目前搜索提升其实并不大。 Drafts 脚本基本就是一个日常高频使用的App 搭配了一个玩具。 可以用，但是场景并不多。 Siri 快捷指令[贾维斯][1]，这款也是一个小玩具，日常很少使用。但是大大提升了原本弱智的Siri Raycast AI重点好用的AI 第一个，他的启动足够快，足够覆盖日常场景 第二个，丰富的快捷键，可以设置AI动作，已经用GPT 替换了原本的谷歌翻译，体验反而更好。故此，目前足够日常使用的GPT，是Raycast的AI能力。目前限免阶段，不知道后续收费如何。 [1]: https://www.icloud.com/shortcuts/c89e8413ebb7450ab9d58626fe53c0d1","link":"/2023/03/08/ChatGPT%E4%BD%93%E9%AA%8C%E4%B8%80%E4%BA%8C/"},{"title":"Drafts 推荐","text":"Drafts，这款产品已经陆陆续续用了快 2 年了，最开始只是用来快捷记录 在 Mac 上快捷记录，在桌面任意位置按住 ⌘Command + 1 快捷打开直接写，或者 ⌘Command +3 直接把你的粘贴板内的保存存储到 Drafts在 iPhone，同样 Drafts 的打开速度永远是快于其他记录 App 的，打开之后一块赶紧的纸面，键盘已经展开，随时开始输入。 基于「快捷输入」这个特性，入坑 Drafts。 后续深入使用之后，除了「快捷输入」这个特点，他的强大的文本处理能力，好像才是这个 App 的精髓。 动作：官方动作，第三方动作，自定义动作，这个应该是 Drafts 的灵魂了吧。用户可以跟据目前文本后续去处，使用对应的动作进行处理。每个人有自己的工作习惯处理习惯，可以深度简化你的操作。 例如：这篇文章就是在「Drafts」+「Working Copy」 在 iPad 的上写完，并且直接部署在github生效。通过动作fetch，把仓库内的文章拉到Drafts，修改完成之后，再通过动作put，把修改后的文章 push 到Working Copy，再通过它更新 github，再自动部署一次，完成发布。 至此，完成了只使用iPad就可以完成HEXO的写作，部署，发布等流程。 所以「动作」 目前来看才是 Drafts 的灵魂功能。 如果不是需要处理表格，图片相关的文字的话，Drafts 应该是目前工作流里面首选的 App 好物推荐一波","link":"/2021/07/12/Drafts%E6%8E%A8%E8%8D%90/"},{"title":"Hexo如何fork主题","text":"Hexo 主题更新的痛点最初使用更换主题用的最多的办法是是将主题 theme 下载下来，解压到 site 目录下。这样使用会带来一个问题。 后续主题 git 有更新的时候，需要更新 theme 的时候，需要手动下载文件覆盖更新，并且需要注意 config 文件的保存 解题思路经过搜索一番优雅的更新主题呢？尝试解决一下 一共分为几步 Fork 主题 git，因为你需要更改里面文件为了保证你有这个仓库的主导权，所以 fork 一份。 通过 Git submodules ，在你的 site 仓库下，作为一个子仓库加入你的项目。 后续使用 git 自动更新主题 Fork 一份主题 Git这一步主要目的，是为了有一份自己可以修改的主题仓库，主要用的办法不熟悉 git 命令，那就直接到 web 页面点击。 添加一个子仓库git submodule add https://github.com/cofess/hexo-theme-pure themes/pure 后续更新 我自己还没研究明白，留白待续","link":"/2021/07/12/Hexo%E8%87%AA%E5%8A%A8%E6%9B%B4%E6%96%B0%E4%B8%BB%E9%A2%98/"},{"title":"Obsidian插件推荐","text":"weread插件 插件用途 同步微信读书笔记，标记 插件地址 GitHub - zhaohongxuan/obsidian-weread-plugin: Obsidian Weread Plugin is a plugin to sync Weread(微信读书) hightlights and annotations into your Obsidian Vault. 推荐理由 无痛导出微信读书笔记到Obsidian","link":"/2022/06/13/Obsidian%E6%8E%A8%E8%8D%90-%E6%8F%92%E4%BB%B6/"},{"title":"Hello World","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post$ hexo new &quot;My New Post&quot; More info: Writing Run server$ hexo server More info: Server Generate static files$ hexo generate More info: Generating Deploy to remote sites$ hexo deploy More info: Deployment","link":"/2017/12/31/hello-world/"},{"title":"微信场景值","text":"微信场景值1000 其他1001 发现栏小程序主入口，「最近使用」列表（基础库 2.2.4 版本起包含「我的小程序」列表）1005 微信首页顶部搜索框的搜索结果页1006 发现栏小程序主入口搜索框的搜索结果1007 单人聊天会话中的小程序消息卡片1008 群聊会话中的小程序消息卡片1010 收藏夹1011 扫描二维码1012 长按图片识别二维码1013 扫描手机相册中选取的二维码1014 小程序模板消息1017 前往小程序体验版的入口页1019 微信钱包（微信客户端 7.0.0 版本改为支付入口）1020 公众号 profile 页相关小程序列表（已废弃）1022 聊天顶部置顶小程序入口（微信客户端 6.6.1 版本起废弃）1023 安卓系统桌面图标1024 小程序 profile 页1025 扫描一维码1026 发现栏小程序主入口，「附近的小程序」列表1027 微信首页顶部搜索框搜索结果页「使用过的小程序」列表1028 我的卡包1029 小程序中的卡券详情页1030 自动化测试下打开小程序1031 长按图片识别一维码1032 扫描手机相册中选取的一维码1034 微信支付完成页1035 公众号自定义菜单1036 App 分享消息卡片1037 小程序打开小程序1038 从另一个小程序返回1039 摇电视 1042 添加好友搜索框的搜索结果页1043 公众号模板消息1044 带 shareTicket 的小程序消息卡片 详情1045 朋友圈广告1046 朋友圈广告详情页1047 扫描小程序码1048 长按图片识别小程序码1049 扫描手机相册中选取的小程序码1052 卡券的适用门店列表1053 搜一搜的结果页1054 顶部搜索框小程序快捷入口（微信客户端版本 6.7.4 起废弃）1056 聊天顶部音乐播放器右上角菜单1057 钱包中的银行卡详情页1058 公众号文章1059 体验版小程序绑定邀请页1064 微信首页连 Wi-Fi 状态栏1067 公众号文章广告1068 附近小程序列表广告（已废弃）1069 移动应用1071 钱包中的银行卡列表页1072 二维码收款页面1073 客服消息列表下发的小程序消息卡片1074 公众号会话下发的小程序消息卡片1077 摇周边1078 微信连 Wi-Fi 成功提示页1079 微信游戏中心1081 客服消息下发的文字链1082 公众号会话下发的文字链1084 朋友圈广告原生页1088 会话中 系统消息，打开小程序1089 微信聊天主界面下拉，「最近使用」栏（基础库 2.2.4 版本起包含「我的小程序」栏）1090 长按小程序右上角菜单唤出最近使用历史1091 公众号文章商品卡片1092 城市服务入口1095 小程序广告组件1096 聊天记录，打开小程序1097 微信支付签约原生页，打开小程序1099 页面内嵌插件1100 红包封面详情页打开小程序1102 公众号 profile 页服务预览1103 发现栏小程序主入口，「我的小程序」列表（基础库 2.2.4 版本起废弃）1104 微信聊天主界面下拉，「我的小程序」栏（基础库 2.2.4 版本起废弃）1106 聊天主界面下拉，从顶部搜索结果页，打开小程序1107 订阅消息，打开小程序1113 安卓手机负一屏，打开小程序（三星）1114 安卓手机侧边栏，打开小程序（三星）1119 【企业微信】工作台内打开小程序1120 【企业微信】个人资料页内打开小程序1121 【企业微信】聊天加号附件框内打开小程序1124 扫“一物一码”打开小程序1125 长按图片识别“一物一码”1126 扫描手机相册中选取的“一物一码”1129 微信爬虫访问 详情1131 浮窗打开小程序1133 硬件设备打开小程序 详情1135 小程序 profile 页其他小程序列表，打开小程序1146 地理位置信息打开出行类小程序1148 卡包-交通卡，打开小程序1150 扫一扫商品条码结果页打开小程序1152 订阅号视频打开小程序1153 “识物”结果页打开小程序1154 朋友圈内打开“单页模式”1155 “单页模式”打开小程序1157 服务号会话页打开小程序1158 群工具打开小程序1167 H5 通过开放标签打开小程序 详情1169 发现栏小程序主入口，各个生活服务入口（例如快递服务、出行服务等）","link":"/2020/12/15/%E5%BE%AE%E4%BF%A1%E5%9C%BA%E6%99%AF%E5%80%BC/"},{"title":"无病呻吟","text":"不知道什么时候起，不爱发朋友圈，却会在dayone记录日记。是自己的生活已经与他人无关了，不太需要与外部交互，事情他依旧有自己的意义。 不知道从什么时候起，不爱在互联网对公众事件进行评论，却会跟身边朋友分享观点，是二极管的世界，观点就是站队朋友却可以讨论。","link":"/2022/07/18/%E6%97%A0%E7%97%85%E5%91%BB%E5%90%9F%E4%B8%80%E4%BA%8C/"},{"title":"牛排知识","text":"牛种的分类世界牛肉四大知名品种： 和牛- 产自日本- 中国境内没有正规渠道购买- 贵 ，牛中劳斯莱斯 安格斯牛 原产英国 奎宁牛 原产意大利 号称世界上最大的牛 肌肉发达，肉质细腻 夏洛莱牛 原产法国 大牌皇室宴会青睐，号称贵族牛 牛排分类牛按部位分类带骨头：战斧，牛小排，牛仔骨，牛肋排不带骨头：西冷，眼肉，菲力 三大经典部位 西冷牛排 价格比眼肉便宜，所以销量比较大 边缘有一层肥油 眼肉 中间有一只”眼睛“ 菲力 菲力为牛里脊 缺乏运动的部位 最嫩的部位 牛排品级 澳洲和牛 从低到高依次为 M1、M2、M3、M4、M5、M6、M7、M8、M9 澳洲安格斯 澳洲安格斯（谷饲）由低到高依次为 100 天、150 天、180 天、200 天、300 天 美国牛肉 Prime(极佳级)、Choice(特选级)、Select(上选级)、Standard(标准级)、Commercial(商业级)、Utility(实用级)、Cutter(切割级)、Canner(制罐级)。 日本和牛 A 级：A5&gt;A4&gt;A3&gt;A2&gt;A1 B 级：B5&gt;B4&gt;B3&gt;B2&gt;B1 C 级：C5&gt;C4&gt;C3&gt;C2&gt;C1 牛排的制作流程 第一步：牛排解冻，我们网购的绝大多数都是冷冻牛排，需要自然解冻至室温，千万不要用热水或者放在微波炉里快速解冻，心急吃不了热豆腐。比如第二天要吃，头天晚上提前放在冷藏室让它慢慢解冻，慢慢解冻的好处是牛排的汁水流失更少。要吃的时候再提前 20 分钟左右从冰箱里取出来，否则牛排表面烤糊了，里面还是冰冷的。 第二步：要煎好牛排少不了一口热锅，热锅的好处就是可以很好的迅速把牛排表面烤焦，锁住牛排内部的汁水。 第三步：用盐和黑胡椒末进行调味，使用研磨器将黑胡椒粒和盐研磨洒在牛排表面。用手均匀涂抹按摩，让味道更好地进入牛排。 第四步、锅热冒烟后，锅一定要热，一是这样不会粘锅，二是迅速锁住牛排内部汁水，然后放入油，转动一下锅使得油均匀一些，润一下锅就可以，油不要多，否则成炸牛排了。 第五步：把牛排放入，大约 30 秒可以看到牛排表面形成美妙的焦褐色，米其林大厨最爱的焦褐感，小心翻面。如果是西冷牛排，可以侧立牛排把外侧脂肪煎烤一下，封边。然后大约每分钟翻面 1 次，让牛排双面颜色均匀。 第六步：加入大蒜，不需要剥皮（有说法是剥皮容易将大蒜烤糊），稍微压扁一下即可；加入百里香或者迷迭香；加入黄油（黄油并不是一开始就放，避免黄油烤焦），抬高锅用汤匙将融化的黄油不断淋在牛排上。将烤制中的大蒜涂抹在牛排表面。 第七步：牛排出锅，斜切装盘。（这里有部分大厨增加有一个叫做 rest 的过程，牛排出锅后静止 5 分钟左右再切，这样牛排的汁水更好的锁住）","link":"/2021/07/26/%E7%89%9B%E6%8E%92%E7%9F%A5%E8%AF%86/"},{"title":"进阶研究1","text":"更换自定义域名 在域名提供商处修改 CNAME 到 XX.github.io 在根目录下 source 目录下 新建 CNAME 文件 内容为： XXX.com 这样，后续通过 CI 编译 CNAME 文件就不会丢失，能持续使用 更换主题 从主题网站 选择喜欢的主题，clone 到 themes 文件夹 修改 hexo 根目录下的配置文件 修改 themes 文件对应的主题配置文件 working copy 同步。 目前比较看到的inside 这个风格很不错，不过应该配置文件问题，展示没有生效 体验地址：inside Cluadia 这款目前应该属于早期，但是质量不错。指的已用，目前正在使用 ing 体验地址：Cluadia","link":"/2021/01/07/%E8%BF%9B%E9%98%B6%E7%A0%94%E7%A9%B61/"},{"title":"github+hexo配置","text":"配置 GITHUB +hexo步骤： Mac 上配置 hexo GIT 整个 hexo 文件夹至 repo 关联 Travis CI 配置关联 Travis CI 的文件 后续发布文件可以使用 iPad working copy，直接 clone master更新文件即可发布新文章 下一步关联自购域名","link":"/2021/01/06/%E9%85%8D%E7%BD%AEgithub+hexo/"},{"title":"信息处理的流程（Part1）","text":"主要工具目前信息处理一共用到的工具主要包含[inoreader][1]，[cubox][2]，[obsidian][3]。 主要流程收集inoreader 主要用来收集主要的信息。 信息来源主要是三类： 没有RSS源的信息来源。搭配[rsshub][4]来使用，可以将很多常用的网站的信息变成RSS订阅源。 已经拥有rss来源的网站。比如[少数派][5]这类自己就有rss源的网站。 微信公众号：有不少付费与免费服务，可以提供微信公众号转RSS，我用的付费的有：[今天看啥][6] 免费的有：[feeddd][7] 等等，可以自己找找。信息的分类 科技类：本身工作属性，关注互联网信息与动态 游戏类：包含游戏资讯网站，毕竟现在假假也是一个游戏开发者。 新闻：主要是海外的一些新闻网站。中文媒体居多，新闻也有，因为英语阅读的效率问题，Inoreader自带翻译功能也提升不少效率。也是订阅inoreader的主要原因。 娱乐：这块就是大面积扫包含微博热榜，知乎热榜。 细读 细读这部分，主要用到的[cubox][8]。通过[ifttt][9]，加上cubox的API接口，生成了一个 星标inoreader文章自动导入cubox Cubox的标注以及导出分享功能。非常不错。 Cubox他是一款稍后阅读App，之前一直用Pocket，但是对国内的支持比较一般，虽然订阅了Pocket，但是基于Cubox国内支持的原因，后迁移到了cubox 他吸引我的点在于 国内特性支持良好： 他支持微信转发消息直接进入cubox收件箱 标注力优秀 标注样式漂亮 操作比较简洁 开发团队效率高 这个可能是国内团队的优点，迭代非常快。很多bug修复很及时，特性的支持也很到位。 优秀的分享体验 Pocket由于墙的原因。里面东西分享很难 cubox支持很好的分享体验 甚至标注也可以一起分享 [1]: https://www.inoreader.com[2]: https://cubox.pro/[3]: https://obsidian.md/[4]: https://docs.rsshub.app/[5]: https://www.sspai.com[6]: http://www.jintiankansha.me/[7]: https://feeddd.org/[8]: https://cubox.pro/[9]: https://ifttt.com/home","link":"/2022/01/04/%E9%98%85%E8%AF%BB%E5%A4%84%E7%90%86%E6%B5%81%E7%A8%8B(Part1)/"}],"tags":[{"name":"记录","slug":"记录","link":"/tags/%E8%AE%B0%E5%BD%95/"},{"name":"心情","slug":"心情","link":"/tags/%E5%BF%83%E6%83%85/"},{"name":"教程","slug":"教程","link":"/tags/%E6%95%99%E7%A8%8B/"},{"name":"GPT","slug":"GPT","link":"/tags/GPT/"},{"name":"AI","slug":"AI","link":"/tags/AI/"},{"name":"好物","slug":"好物","link":"/tags/%E5%A5%BD%E7%89%A9/"},{"name":"Hexo","slug":"Hexo","link":"/tags/Hexo/"},{"name":"推荐","slug":"推荐","link":"/tags/%E6%8E%A8%E8%8D%90/"},{"name":"Obsidian","slug":"Obsidian","link":"/tags/Obsidian/"},{"name":"收集整理","slug":"收集整理","link":"/tags/%E6%94%B6%E9%9B%86%E6%95%B4%E7%90%86/"},{"name":"随笔","slug":"随笔","link":"/tags/%E9%9A%8F%E7%AC%94/"},{"name":"兴趣","slug":"兴趣","link":"/tags/%E5%85%B4%E8%B6%A3/"},{"name":"cubox","slug":"cubox","link":"/tags/cubox/"},{"name":"Inoreader","slug":"Inoreader","link":"/tags/Inoreader/"}],"categories":[],"pages":[{"title":"about","text":"关于这里闲谈： 支持闲谈部分收集： 把一些好东西都收藏到这里经验： 汇总一些收集到的经验","link":"/about/index.html"}]}